ressources-relationnelles/myapp/app/Models/Analyse_model.php

SELECT *
FROM `analyse`
WHERE `company_id` = '2'
---
    public function retrieveAll($company_id){
        $test = $this->where('company_id', $company_id)->findAll();