ressources-relationnelles/myapp/app/Models/Competence_model.php

SELECT *
FROM `axe_competence`
---
    public function retrieveAll(){
        $test = $this->findAll();