ressources-relationnelles/myapp/app/Models/Company_model.php

SELECT *
FROM `company`
---
    public function retrieveAll(){
        $test = $this->findAll();