ressources-relationnelles/myapp/app/Models/Competence_model.php

SELECT *
FROM `axe_competence`
WHERE `company_id` = '2'
---
    public function retrieveAll($company_id){
        $test = $this->where('company_id', $company_id)->findAll();