ressources-relationnelles/myapp/app/Models/Numerique_model.php

SELECT *
FROM `axe_num`
WHERE `company_id` = '1'
---
    public function retrieveAll($company_id){
        $test = $this->where('company_id', $company_id)->findAll();