ressources-relationnelles/myapp/app/Models/Synthese_model.php

    public function retrieveAll($company_id){
        $test = $this->where('company_id', $company_id)->findAll();
---
SELECT *
FROM `synthese`
WHERE `company_id` = '1'