ressources-relationnelles/myapp/app/Models/Synthese_model.php

    public function retrieveAll(){
        $test = $this->findAll();
---
SELECT *
FROM `synthese`